
## :x: Apply Failed (pocket-router-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/6867)



It failed to parse the result.

<details><summary>Details (Click me)</summary>

```hcl
data.pagerduty_vendor.pagerduty_sentry_FFB12B7C: Reading...
data.pagerduty_vendor.pagerduty_cloudwatch_7956692A: Reading...
data.pagerduty_escalation_policy.mozilla_sre_escalation_policy: Reading...
data.aws_kms_alias.kms_alias: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs_codedeploy_codedeploy_assume_role_C76E7224: Reading...
data.aws_region.region: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs-iam_ecs-task-assume_05903663: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs_codedeploy_codedeploy_assume_role_C76E7224: Read complete after 0s [id=4250039221]
data.aws_caller_identity.caller: Reading...
data.aws_region.region: Read complete after 0s [id=us-east-1]
data.aws_s3_bucket.application_application_load_balancer_log-bucket_417BB177: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs-iam_ecs-task-assume_05903663: Read complete after 0s [id=1077804475]
data.aws_caller_identity.caller: Read complete after 0s [id=996905175585]
data.aws_route53_zone.application_base_dns_main_hosted_zone_0141FA96: Reading...
data.aws_region.application_pocket_vpc_current_region_7774DA97: Reading...
data.aws_caller_identity.application_pocket_vpc_current_identity_0A422301: Reading...
data.aws_region.application_pocket_vpc_current_region_7774DA97: Read complete after 0s [id=us-east-1]
data.aws_caller_identity.application_pocket_vpc_current_identity_0A422301: Read complete after 0s [id=996905175585]
data.aws_kms_alias.kms_alias: Read complete after 0s [id=arn:aws:kms:us-east-1:996905175585:alias/aws/secretsmanager]
data.aws_ssm_parameter.application_pocket_vpc_public_subnets_282A59F4: Reading...
data.aws_sns_topic.backend_notifications: Reading...
data.aws_ssm_parameter.application_pocket_vpc_private_subnets_424C83F8: Reading...
data.aws_ssm_parameter.application_pocket_vpc_vpc_ssm_param_DD9C7A4F: Reading...
data.aws_iam_policy_document.synthetics_synthetics_synthetic_check_assume_66385ECA: Reading...
data.aws_iam_policy_document.synthetics_synthetics_synthetic_check_assume_66385ECA: Read complete after 0s [id=2690255455]
data.aws_kms_alias.application_pocket_vpc_secrets_manager_key_2C3C8766: Reading...
data.aws_kms_alias.application_pocket_vpc_secrets_manager_key_2C3C8766: Read complete after 0s [id=arn:aws:kms:us-east-1:996905175585:alias/aws/secretsmanager]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-role-policy_090CC3AD: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-role-policy_090CC3AD: Read complete after 0s [id=1756567564]
data.aws_region.application_ecs_service_ecs_codedeploy_current_region_A377EAA5: Reading...
data.aws_region.application_ecs_service_ecs_codedeploy_current_region_A377EAA5: Read complete after 0s [id=us-east-1]
data.aws_caller_identity.application_ecs_service_ecs_codedeploy_current_account_110B92B7: Reading...
data.aws_caller_identity.application_ecs_service_ecs_codedeploy_current_account_110B92B7: Read complete after 0s [id=996905175585]
data.aws_ssm_parameter.application_pocket_vpc_private_subnets_424C83F8: Read complete after 0s [id=/Shared/PrivateSubnets]
data.aws_ssm_parameter.application_pocket_vpc_vpc_ssm_param_DD9C7A4F: Read complete after 0s [id=/Shared/Vpc]
data.aws_s3_bucket.application_application_load_balancer_log-bucket_417BB177: Read complete after 0s [id=pocket-data-items]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-execution-role-policy_015FDEBA: Reading...
data.aws_ssm_parameter.application_pocket_vpc_public_subnets_282A59F4: Read complete after 0s [id=/Shared/PublicSubnets]
data.aws_sns_topic.backend_notifications: Read complete after 0s [id=arn:aws:sns:us-east-1:996905175585:Backend-Prod-ChatBot]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-execution-role-policy_015FDEBA: Read complete after 0s [id=615393287]
data.aws_vpc.application_pocket_vpc_22D55D83: Reading...
data.pagerduty_escalation_policy.mozilla_sre_escalation_policy: Read complete after 0s [id=PLPWYPC]
data.aws_vpc.application_pocket_vpc_22D55D83: Read complete after 0s [id=vpc-867638e3]
data.aws_security_groups.application_pocket_vpc_default_security_groups_4D3B6986: Reading...
data.aws_security_groups.application_pocket_vpc_internal_security_groups_8D057D72: Reading...
data.aws_subnets.application_pocket_vpc_private_subnet_ids_AED9F181: Reading...
data.aws_subnets.application_pocket_vpc_public_subnet_ids_4577655C: Reading...
data.aws_route53_zone.application_base_dns_main_hosted_zone_0141FA96: Read complete after 0s [id=Z21HMDYFB951W4]
data.pagerduty_vendor.pagerduty_sentry_FFB12B7C: Read complete after 0s [id=PKAPG94]
data.pagerduty_vendor.pagerduty_cloudwatch_7956692A: Read complete after 0s [id=PZQ6AUS]
data.aws_subnets.application_pocket_vpc_public_subnet_ids_4577655C: Read complete after 0s [id=us-east-1]
data.aws_subnets.application_pocket_vpc_private_subnet_ids_AED9F181: Read complete after 0s [id=us-east-1]
data.aws_security_groups.application_pocket_vpc_default_security_groups_4D3B6986: Read complete after 0s [id=us-east-1]
data.aws_security_groups.application_pocket_vpc_internal_security_groups_8D057D72: Read complete after 1s [id=us-east-1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.synthetics_synthetics_synthetic_check_access_4C83FECF will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "synthetics_synthetics_synthetic_check_access_4C83FECF" {
      + id      = (known after apply)
      + json    = (known after apply)
      + version = "2012-10-17"

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::pocket-syntheticchecks-prod/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetBucketLocation",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListAllMyBuckets",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "cloudwatch:PutMetricData",
            ]
          + resources = [
              + "*",
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "CloudWatchSynthetics",
                ]
              + variable = "cloudwatch:namespace"
            }
        }
      + statement {
          + actions   = [
              + "ec2:AttachNetworkInterface",
              + "ec2:CreateNetworkInterface",
              + "ec2:DeleteNetworkInterface",
              + "ec2:DescribeNetworkInterfaces",
            ]
          + resources = [
              + "*",
            ]
        }
    }

  # aws_acm_certificate.application_alb_certificate_93966247 will be created
  + resource "aws_acm_certificate" "application_alb_certificate_93966247" {
      + arn                       = (known after apply)
      + domain_name               = "direct.pocket-router.getpocket.com"
      + domain_validation_options = [
          + {
              + domain_name           = "direct.pocket-router.getpocket.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "direct.pocket-router.getpocket.com",
        ]
      + tags                      = {
          + "environment" = "Prod"
          + "service"     = "PocketRouter"
        }
      + tags_all                  = {
          + "environment" = "Prod"
          + "service"     = "PocketRouter"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_acm_certificate.application_cdn_certificate_E17B2815 will be created
  + resource "aws_acm_certificate" "application_cdn_certificate_E17B2815" {
      + arn                       = (known after apply)
      + domain_name               = "pocket-router.getpocket.com"
      + domain_validation_options = [
          + {
              + domain_name           = "pocket-router.getpocket.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "pocket-router.getpocket.com",
        ]
      + tags                      = {
          + "environment" = "Prod"
          + "service"     = "PocketRouter"
        }
      + tags_all                  = {
          + "environment" = "Prod"
          + "service"     = "PocketRouter"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_acm_certificate_validation.application_alb_certificate_certificate_validation_25DAB195 will be created
  + resource "aws_acm_certificate_validation" "application_alb_certificate_certificate_validation_25DAB195" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_acm_certificate_validation.application_cdn_certificate_certificate_validation_F216BBC7 will be created
  + resource "aws_acm_certificate_validation" "application_cdn_certificate_certificate_validation_F216BBC7" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_alb.application_application_load_balancer_alb_05EA9801 will be created
  + resource "aws_alb" "application_application_load_balancer_alb_05EA9801" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = (known after apply)
      + name_prefix                                                  = "ROUTER"
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = [
          + "subnet-36c2611d",
          + "subnet-420db61b",
          + "subnet-5a0f952d",
          + "subnet-6b400e51",
        ]
      + tags                                                         = {
          + "environment" = "Prod"
          + "service"     = "PocketRouter"
        }
      + tags_all                                                     = {
          + "environment" = "Prod"
          + "service"     = "PocketRouter"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + access_logs {
          + bucket  = "pocket-data-items"
          + enabled = true
          + prefix  = "server-logs/pocketrouter-prod/alb"
        }
    }

  # aws_alb_listener.application_listener_http_D74EC0ED will be created
  + resource "aws_alb_listener" "application_listener_http_D74EC0ED" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags              = {
          + "environment" = "Prod"
          + "service"     = "PocketRouter"
        }
      + tags_all          = {
          + "environment" = "Prod"
          + "service"     = "PocketRouter"
        }

      + default_action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "#{host}"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }
    }

  # aws_alb_listener.application_listener_https_D31CB055 will be created
  + resource "aws_alb_listener" "application_listener_https_D31CB055" {
      + arn               = (known after apply)
      + certificate_arn   = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 443
      + protocol          = "HTTPS"
      + ssl_policy        = "ELBSecurityPolicy-TLS-1-1-2017-01"
      + tags              = {
          + "environment" = "Prod"
          + "service"     = "PocketRouter"
        }
      + tags_all          = {
          + "environment" = "Prod"
          + "service"     = "PocketRouter"
        }

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + status_code  = "503"
            }
        }
    }

  # aws_alb_listener_rule.application_ecs_service_listener_rule_903F815F will be created
  + resource "aws_alb_listener_rule" "application_ecs_service_listener_rule_903F815F" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 1
      + tags         = {
          + "environment" = "Prod"
          + "service"     = "PocketRouter"
        }
      + tags_all     = {
          + "environment" = "Prod"
          + "service"     = "PocketRouter"
        }

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + path_pattern {
              + values = [
                  + "*",
                ]
            }
        }
    }

  # aws_alb_target_group.application_ecs_service_blue_target_group_ecs_target_group_4A9BF49B will be created
  + resource "aws_alb_target_group" "application_ecs_service_blue_target_group_ecs_target_group_4A9BF49B" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "120"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = (known after apply)
      + name_prefix                        = "ROUTER"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "environment" = "Prod"
          + "service"     = "PocketRouter"
          + "type"        = "blue"
        }
      + tags_all                           = {
          + "environment" = "Prod"
          + "service"     = "PocketRouter"
          + "type"        = "blue"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-867638e3"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 5
          + interval            = 15
          + matcher             = (known after apply)
          + path                = "/.well-known/apollo/server-health"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = (known after apply)
          + unhealthy_threshold = 3
        }
    }

  # aws_alb_target_group.application_ecs_service_green_target_group_ecs_target_group_4E06DCA6 will be created
  + resource "aws_alb_target_group" "application_ecs_service_green_target_group_ecs_target_group_4E06DCA6" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "120"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

eation complete after 0s [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:targetgroup/ROUTER20240108182615747500000004/17d6cbf68cefc529]
aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-execution-role-policy_2D469A77: Creating...
aws_iam_role.application_ecs_service_ecs-iam_ecs-execution-role_FB754BAA: Creation complete after 0s [id=PocketRouter-Prod-TaskExecutionRole]
aws_ecr_lifecycle_policy.application_ecs_service_ecr-app_ecr-repo-lifecyclepolicy_CCDF75B7: Creating...
aws_iam_role.application_ecs_service_ecs-iam_ecs-task-role_A72990ED: Creation complete after 0s [id=PocketRouter-Prod-TaskRole]
aws_iam_role_policy_attachment.application_ecs_service_ecs_codedeploy_ecs_codedeploy_role_attachment_1A1D5725: Creating...
aws_ecr_lifecycle_policy.application_ecs_service_ecr-app_ecr-repo-lifecyclepolicy_CCDF75B7: Creation complete after 0s [id=pocketrouter-prod-app]
aws_codestarnotifications_notification_rule.application_ecs_service_ecs_codedeploy_ecs_codedeploy_notifications_CB44EADE: Creating...
aws_alb_target_group.application_ecs_service_blue_target_group_ecs_target_group_4A9BF49B: Creation complete after 1s [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:targetgroup/ROUTER20240108182615890000000005/360f52f0f337bcfc]
aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-execution-role-policy_2D469A77: Creation complete after 1s [id=arn:aws:iam::996905175585:policy/PocketRouter-Prod-TaskExecutionRolePolicy]
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23: Creating...
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5: Creating...
aws_iam_role_policy_attachment.application_ecs_service_ecs_codedeploy_ecs_codedeploy_role_attachment_1A1D5725: Creation complete after 1s [id=PocketRouter-Prod-ECSCodeDeployRole-20240108182616510400000007]
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197: Creating...
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23: Creation complete after 0s [id=PZXTZJK]
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C: Creating...
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5: Creation complete after 0s [id=PVL5Z7X]
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-default-attachment_99A621FF: Creating...
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-default-attachment_99A621FF: Creation complete after 0s [id=PocketRouter-Prod-TaskExecutionRole-20240108182616964100000008]
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-custom-attachment_F8DDD355: Creating...
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197: Creation complete after 0s [id=PSOHYV7]
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Creating...
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-custom-attachment_F8DDD355: Creation complete after 0s [id=PocketRouter-Prod-TaskRole-20240108182617084800000009]
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-custom-attachment_046B7E2E: Creating...
aws_codestarnotifications_notification_rule.application_ecs_service_ecs_codedeploy_ecs_codedeploy_notifications_CB44EADE: Creation complete after 1s [id=arn:aws:codestar-notifications:us-east-1:996905175585:notificationrule/fcaf506751493052049a1ef9788688eda2789672]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Creating...
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Creation complete after 0s [id=PocketRouter-Prod]
local_file.application_ecs_service_appspec_94386B9C: Creating...
local_file.application_ecs_service_appspec_94386B9C: Creation complete after 0s [id=c1d3d4c20b5a3fee7ef21e38a111aad0a37207cf]
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C: Creation complete after 0s [id=POCWXFH]
aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B: Creating...
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-custom-attachment_046B7E2E: Creation complete after 0s [id=PocketRouter-Prod-TaskExecutionRole-2024010818261720610000000a]
aws_security_group.application_application_load_balancer_alb_security_group_7B45D070: Creation complete after 1s [id=sg-091fcc9d7f0ec644b]
aws_security_group.application_ecs_service_ecs_security_group_231C6B1E: Creating...
aws_alb.application_application_load_balancer_alb_05EA9801: Creating...
aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B: Creation complete after 1s [id=arn:aws:sns:us-east-1:996905175585:PocketRouter-Prod-Infrastructure-Alarm-Non-Critical:ac0dba51-1137-401d-84f2-f10f2e11011e]
aws_security_group.application_ecs_service_ecs_security_group_231C6B1E: Creation complete after 2s [id=sg-03a91e8af0a161905]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Creation complete after 2s [id=arn:aws:sns:us-east-1:996905175585:PocketRouter-Prod-Infrastructure-Alarm-Critical:efb0ca4c-692a-4ffd-a65e-fd31a229b17b]
aws_acm_certificate.application_alb_certificate_93966247: Creation complete after 9s [id=arn:aws:acm:us-east-1:996905175585:certificate/277af277-ded7-4fe1-9774-a2ab6413ad90]
aws_acm_certificate.application_cdn_certificate_E17B2815: Creation complete after 8s [id=arn:aws:acm:us-east-1:996905175585:certificate/cd679bbd-d16c-4910-a8a5-1873830cb9b8]
aws_s3_bucket.synthetics_synthetics_synthetic_check_artifacts_53DD59E6: Still creating... [10s elapsed]
aws_ecs_cluster.application_ecs_cluster_4DC6EFB3: Still creating... [10s elapsed]
aws_route53_zone.application_base_dns_subhosted_zone_77521D1C: Still creating... [10s elapsed]
aws_ecs_cluster.application_ecs_cluster_4DC6EFB3: Creation complete after 11s [id=arn:aws:ecs:us-east-1:996905175585:cluster/PocketRouter-Prod]
aws_alb.application_application_load_balancer_alb_05EA9801: Still creating... [10s elapsed]
aws_s3_bucket.synthetics_synthetics_synthetic_check_artifacts_53DD59E6: Creation complete after 16s [id=pocket-pocketrouter-prod-synthetic-checks]
data.aws_iam_policy_document.synthetics_synthetics_synthetic_check_access_4C83FECF: Reading...
aws_synthetics_canary.synthetics_synthetics_synthetic_check_uptime_0_4168D0DB: Creating...
aws_s3_bucket_lifecycle_configuration.synthetics_synthetics_synthetic_check_artifacts_lifecycle_5A7B9150: Creating...
data.aws_iam_policy_document.synthetics_synthetics_synthetic_check_access_4C83FECF: Read complete after 0s [id=1549168643]
aws_iam_policy.synthetics_synthetics_synthetic_check_access_policy_9A7D8849: Creating...
aws_iam_policy.synthetics_synthetics_synthetic_check_access_policy_9A7D8849: Creation complete after 1s [id=arn:aws:iam::996905175585:policy/pocket-pocketrouter-prod-synthetic-check-access]
aws_iam_role_policy_attachment.synthetics_synthetics_synthetic_check_access_attach_BC7F9559: Creating...
aws_iam_role_policy_attachment.synthetics_synthetics_synthetic_check_access_attach_BC7F9559: Creation complete after 0s [id=pocket-pocketrouter-prod-synthetic-check-2024010818263163820000000d]
aws_route53_zone.application_base_dns_subhosted_zone_77521D1C: Still creating... [20s elapsed]
aws_alb.application_application_load_balancer_alb_05EA9801: Still creating... [20s elapsed]
aws_synthetics_canary.synthetics_synthetics_synthetic_check_uptime_0_4168D0DB: Still creating... [10s elapsed]
aws_s3_bucket_lifecycle_configuration.synthetics_synthetics_synthetic_check_artifacts_lifecycle_5A7B9150: Still creating... [10s elapsed]
aws_route53_zone.application_base_dns_subhosted_zone_77521D1C: Still creating... [30s elapsed]
aws_alb.application_application_load_balancer_alb_05EA9801: Still creating... [30s elapsed]
aws_synthetics_canary.synthetics_synthetics_synthetic_check_uptime_0_4168D0DB: Still creating... [20s elapsed]
aws_s3_bucket_lifecycle_configuration.synthetics_synthetics_synthetic_check_artifacts_lifecycle_5A7B9150: Still creating... [20s elapsed]
aws_route53_zone.application_base_dns_subhosted_zone_77521D1C: Still creating... [40s elapsed]
aws_synthetics_canary.synthetics_synthetics_synthetic_check_uptime_0_4168D0DB: Creation complete after 26s [id=router-prod-uptime-0]
aws_cloudwatch_metric_alarm.synthetics_synthetics_synthetic_check_alarm_uptime_0_3A56DFC7: Creating...
aws_cloudwatch_metric_alarm.synthetics_synthetics_synthetic_check_alarm_uptime_0_3A56DFC7: Creation complete after 0s [id=router-prod-uptime-0]
aws_alb.application_application_load_balancer_alb_05EA9801: Still creating... [40s elapsed]
aws_s3_bucket_lifecycle_configuration.synthetics_synthetics_synthetic_check_artifacts_lifecycle_5A7B9150: Still creating... [30s elapsed]
aws_s3_bucket_lifecycle_configuration.synthetics_synthetics_synthetic_check_artifacts_lifecycle_5A7B9150: Creation complete after 31s [id=pocket-pocketrouter-prod-synthetic-checks]
aws_route53_zone.application_base_dns_subhosted_zone_77521D1C: Still creating... [50s elapsed]
aws_alb.application_application_load_balancer_alb_05EA9801: Still creating... [50s elapsed]
aws_route53_zone.application_base_dns_subhosted_zone_77521D1C: Creation complete after 55s [id=Z00239121N1EPWRJ9GOLW]
aws_route53_record.application_alb_certificate_certificate_record_51B45CF2: Creating...
aws_route53_record.application_cdn_certificate_certificate_record_F3EF0357: Creating...
aws_route53_record.application_base_dns_subhosted_zone_ns_DFB88A22: Creating...
aws_alb.application_application_load_balancer_alb_05EA9801: Still creating... [1m0s elapsed]
aws_route53_record.application_alb_certificate_certificate_record_51B45CF2: Still creating... [10s elapsed]
aws_route53_record.application_base_dns_subhosted_zone_ns_DFB88A22: Still creating... [10s elapsed]
aws_route53_record.application_cdn_certificate_certificate_record_F3EF0357: Still creating... [10s elapsed]
aws_alb.application_application_load_balancer_alb_05EA9801: Still creating... [1m10s elapsed]
aws_route53_record.application_alb_certificate_certificate_record_51B45CF2: Still creating... [20s elapsed]
aws_route53_record.application_cdn_certificate_certificate_record_F3EF0357: Still creating... [20s elapsed]
aws_route53_record.application_base_dns_subhosted_zone_ns_DFB88A22: Still creating... [20s elapsed]
aws_alb.application_application_load_balancer_alb_05EA9801: Still creating... [1m20s elapsed]
aws_route53_record.application_alb_certificate_certificate_record_51B45CF2: Still creating... [30s elapsed]
aws_route53_record.application_base_dns_subhosted_zone_ns_DFB88A22: Still creating... [30s elapsed]
aws_route53_record.application_cdn_certificate_certificate_record_F3EF0357: Still creating... [30s elapsed]
aws_alb.application_application_load_balancer_alb_05EA9801: Still creating... [1m30s elapsed]
aws_route53_record.application_alb_certificate_certificate_record_51B45CF2: Still creating... [40s elapsed]
aws_route53_record.application_cdn_certificate_certificate_record_F3EF0357: Still creating... [40s elapsed]
aws_route53_record.application_base_dns_subhosted_zone_ns_DFB88A22: Still creating... [40s elapsed]
aws_alb.application_application_load_balancer_alb_05EA9801: Still creating... [1m40s elapsed]
aws_route53_record.application_cdn_certificate_certificate_record_F3EF0357: Creation complete after 49s [id=Z00239121N1EPWRJ9GOLW__d5828916618c04070a5a9bf6a889d1b7.pocket-router.getpocket.com._CNAME]
aws_acm_certificate_validation.application_cdn_certificate_certificate_validation_F216BBC7: Creating...
aws_acm_certificate_validation.application_cdn_certificate_certificate_validation_F216BBC7: Creation complete after 1s [id=2024-01-08 18:27:33.426 +0000 UTC]
aws_route53_record.application_alb_certificate_certificate_record_51B45CF2: Still creating... [50s elapsed]
aws_route53_record.application_base_dns_subhosted_zone_ns_DFB88A22: Still creating... [50s elapsed]
aws_alb.application_application_load_balancer_alb_05EA9801: Still creating... [1m50s elapsed]
aws_route53_record.application_alb_certificate_certificate_record_51B45CF2: Creation complete after 57s [id=Z00239121N1EPWRJ9GOLW__7570a80b28b05bc6476cd2ebaf1e787f.direct.pocket-router.getpocket.com._CNAME]
aws_acm_certificate_validation.application_alb_certificate_certificate_validation_25DAB195: Creating...
aws_acm_certificate_validation.application_alb_certificate_certificate_validation_25DAB195: Creation complete after 1s [id=2024-01-08 18:27:34.515 +0000 UTC]
aws_route53_record.application_base_dns_subhosted_zone_ns_DFB88A22: Still creating... [1m0s elapsed]
aws_route53_record.application_base_dns_subhosted_zone_ns_DFB88A22: Creation complete after 1m1s [id=Z21HMDYFB951W4_pocket-router.getpocket.com_NS]
aws_alb.application_application_load_balancer_alb_05EA9801: Still creating... [2m0s elapsed]
aws_alb.application_application_load_balancer_alb_05EA9801: Still creating... [2m10s elapsed]
aws_alb.application_application_load_balancer_alb_05EA9801: Still creating... [2m20s elapsed]
aws_alb.application_application_load_balancer_alb_05EA9801: Still creating... [2m30s elapsed]
aws_alb.application_application_load_balancer_alb_05EA9801: Still creating... [2m40s elapsed]
aws_alb.application_application_load_balancer_alb_05EA9801: Creation complete after 2m42s [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:loadbalancer/app/ROUTER2024010818261727420000000c/845ad5db62fa634f]
aws_alb_listener.application_listener_https_D31CB055: Creating...
aws_cloudwatch_metric_alarm.application_alarm-httpresponsetime_9124C30A: Creating...
aws_route53_record.application_alb_record_8EA9D3F9: Creating...
aws_cloudwatch_metric_alarm.application_alarm-httptarget5xxerrorrate_F94D87C0: Creating...
aws_alb_listener.application_listener_http_D74EC0ED: Creating...
aws_cloudwatch_metric_alarm.application_alarm-httptarget5xxerrorrate_F94D87C0: Creation complete after 1s [id=PocketRouter-Prod-Alarm-HTTPTarget5xxErrorRate]
aws_cloudwatch_metric_alarm.application_alarm-httpresponsetime_9124C30A: Creation complete after 1s [id=PocketRouter-Prod-Alarm-HTTPResponseTime]
aws_alb_listener.application_listener_http_D74EC0ED: Creation complete after 1s [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:listener/app/ROUTER2024010818261727420000000c/845ad5db62fa634f/8e133c00261501cf]
aws_alb_listener.application_listener_https_D31CB055: Creation complete after 1s [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:listener/app/ROUTER2024010818261727420000000c/845ad5db62fa634f/2576b3870cd96d9e]
aws_alb_listener_rule.application_ecs_service_listener_rule_903F815F: Creating...
aws_alb_listener_rule.application_ecs_service_listener_rule_903F815F: Creation complete after 0s [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:listener-rule/app/ROUTER2024010818261727420000000c/845ad5db62fa634f/2576b3870cd96d9e/9b0308c2a6885982]
aws_ecs_service.application_ecs_service_ecs-service_A8BAB5F4: Creating...
aws_ecs_service.application_ecs_service_ecs-service_A8BAB5F4: Creation complete after 1s [id=arn:aws:ecs:us-east-1:996905175585:service/PocketRouter-Prod/PocketRouter-Prod]
aws_cloudwatch_dashboard.application_cloudwatch-dashboard_1F3DC0ED: Creating...
aws_appautoscaling_target.application_autoscaling_autoscaling_target_42BF5C99: Creating...
aws_codedeploy_deployment_group.application_ecs_service_ecs_codedeploy_ecs_codedeploy_deployment_group_48384247: Creating...
aws_cloudwatch_dashboard.application_cloudwatch-dashboard_1F3DC0ED: Creation complete after 0s [id=PocketRouter-Prod]
aws_codedeploy_deployment_group.application_ecs_service_ecs_codedeploy_ecs_codedeploy_deployment_group_48384247: Creation complete after 1s [id=fb632fe4-7046-4d21-b0ea-36a49d8ce3bb]
aws_route53_record.application_alb_record_8EA9D3F9: Still creating... [10s elapsed]
aws_route53_record.application_alb_record_8EA9D3F9: Still creating... [20s elapsed]
aws_route53_record.application_alb_record_8EA9D3F9: Still creating... [30s elapsed]
aws_route53_record.application_alb_record_8EA9D3F9: Creation complete after 38s [id=Z00239121N1EPWRJ9GOLW_direct.pocket-router.getpocket.com_A_1]
aws_cloudfront_distribution.application_cloudfront_distribution_B95C3E21: Creating...
aws_cloudfront_distribution.application_cloudfront_distribution_B95C3E21: Still creating... [10s elapsed]
aws_cloudfront_distribution.application_cloudfront_distribution_B95C3E21: Still creating... [20s elapsed]
aws_cloudfront_distribution.application_cloudfront_distribution_B95C3E21: Still creating... [30s elapsed]
aws_cloudfront_distribution.application_cloudfront_distribution_B95C3E21: Still creating... [40s elapsed]
aws_cloudfront_distribution.application_cloudfront_distribution_B95C3E21: Still creating... [50s elapsed]
aws_cloudfront_distribution.application_cloudfront_distribution_B95C3E21: Still creating... [1m0s elapsed]
aws_cloudfront_distribution.application_cloudfront_distribution_B95C3E21: Still creating... [1m10s elapsed]
aws_cloudfront_distribution.application_cloudfront_distribution_B95C3E21: Still creating... [1m20s elapsed]
aws_cloudfront_distribution.application_cloudfront_distribution_B95C3E21: Still creating... [1m30s elapsed]
aws_cloudfront_distribution.application_cloudfront_distribution_B95C3E21: Still creating... [1m40s elapsed]
aws_cloudfront_distribution.application_cloudfront_distribution_B95C3E21: Still creating... [1m50s elapsed]
aws_cloudfront_distribution.application_cloudfront_distribution_B95C3E21: Still creating... [2m0s elapsed]
aws_cloudfront_distribution.application_cloudfront_distribution_B95C3E21: Still creating... [2m10s elapsed]
aws_cloudfront_distribution.application_cloudfront_distribution_B95C3E21: Still creating... [2m20s elapsed]
aws_cloudfront_distribution.application_cloudfront_distribution_B95C3E21: Still creating... [2m30s elapsed]
aws_cloudfront_distribution.application_cloudfront_distribution_B95C3E21: Still creating... [2m40s elapsed]
aws_cloudfront_distribution.application_cloudfront_distribution_B95C3E21: Still creating... [2m50s elapsed]
aws_cloudfront_distribution.application_cloudfront_distribution_B95C3E21: Still creating... [3m0s elapsed]
aws_cloudfront_distribution.application_cloudfront_distribution_B95C3E21: Creation complete after 3m8s [id=EBJK4TT43EPRZ]
aws_route53_record.application_cdn_record_B2BBECBB: Creating...
aws_route53_record.application_cdn_record_B2BBECBB: Still creating... [10s elapsed]
aws_route53_record.application_cdn_record_B2BBECBB: Still creating... [20s elapsed]
aws_route53_record.application_cdn_record_B2BBECBB: Still creating... [30s elapsed]
aws_route53_record.application_cdn_record_B2BBECBB: Still creating... [40s elapsed]
aws_route53_record.application_cdn_record_B2BBECBB: Creation complete after 48s [id=Z00239121N1EPWRJ9GOLW_pocket-router.getpocket.com_A_2]
╷
│ Warning: Deprecated attribute
│ 
│   on cdk.tf.json line 1842, in resource.aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84:
│ 1842:         "endpoint": "https://events.pagerduty.com/integration/${pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5.integration_key}/enqueue",
│ 
│ The attribute "integration_key" is deprecated. Refer to the provider
│ documentation for details.
│ 
│ (and 7 more similar warnings elsewhere)
╵
╷
│ Error: listing tags for Application Auto Scaling Target (arn:aws:application-autoscaling:us-east-1:996905175585:scalable-target/0ec51053a2e54ef9450fa7c8d649f57d9bce): ResourceNotFoundException: Scalable Target not found
│ {
│   RespMetadata: {
│     StatusCode: 400,
│     RequestID: "2e982121-7845-4bce-b3bb-132b9df2d734"
│   },
│   Message_: "Scalable Target not found"
│ }
│ 
│   with aws_appautoscaling_target.application_autoscaling_autoscaling_target_42BF5C99,
│   on cdk.tf.json line 842, in resource.aws_appautoscaling_target.application_autoscaling_autoscaling_target_42BF5C99:
│  842:       }
│ 
╵

```

</details>

<!-- github-comment: {"Command":"apply","JobID":"0a10c0e5-ff82-4ebb-9b84-2bd4c7d75685","JobName":"pocket-router_infrastructure_apply_prod","PRNumber":41,"Program":"tfcmt","SHA1":"3834b7e5dbc6a251ce25ff16eefc47b8a79c42cf","Target":"pocket-router-cdk","Vars":{}} -->